# Gather Section (20 Questions, 40 Marks)

You should have access to a file called TMDB.db. The first step to answering this set of questions will be to connect to this db file to access the data. 

![SQL Architectures](https://raw.githubusercontent.com/Explore-AI/Public-Data/master/image/TMDB_ERD.JPG)

Before we start we need to load our SQL magic commands (we only need do this once per notebook):

In [1]:
%load_ext sql

*Note: we have to prepend a Jupyter notebook cell with `%%sql` in order to run a SQL query. Place your code in the '# Your code here' lines. If you experience trouble connecting to the .db file, please ensure that you have the `pymysql` and `ipython-sql` packages installed. Also ensure that `sqlalchemy` is pinned at a version <2.*


Based on that data, answer the following questions:


### Question 11
What is the code you can use to connect to the TMBD database that is saved in the same location with the Jupyter notebook?

In [2]:
%%sql
sqlite:///TMDB.db

'Connected: @TMDB.db'

### Question 12
What is the primary key for the table “movies”? Movie_Id

### Question 13
How many foreign keys does the “languagemap” table have? 2

### Question 14
What code would you use to set up a view of all movies that did not get released?

In [7]:
%%sql
DROP VIEW Not_Released;

 * sqlite:///TMDB.db
Done.

[]

In [8]:
%%sql 
CREATE VIEW Not_Released AS
SELECT * 
FROM movies 
WHERE release_status <> 'Released';

 * sqlite:///TMDB.db
Done.

[]

### Question 15
How would you select only the title, release date, and release status columns from the view you created in the previous question?

In [9]:
%%sql 
Select title,
release_date,
release_status 
From Not_Released;

 * sqlite:///TMDB.db
Done.

[('Little Big Top', '2006-01-01 00:00:00.000000', 'Rumored'),
 ('The Helix... Loaded', '2005-01-01 00:00:00.000000', 'Rumored'),
 ('Higher Ground', '2011-08-26 00:00:00.000000', 'Post Production'),
 ('Crying with Laughter', '2009-06-01 00:00:00.000000', 'Rumored'),
 ('The Harvest (La Cosecha)', '2011-07-29 00:00:00.000000', 'Rumored'),
 ('The Naked Ape', '2006-09-16 00:00:00.000000', 'Rumored'),
 ('Brotherly Love', '2015-04-24 00:00:00.000000', 'Post Production'),
 ("Dancin' It's On", '2015-10-16 00:00:00.000000', 'Post Production')]

### Question 16
How many movies are no longer using their original titles?

In [10]:
%%sql
SELECT COUNT(*)
FROM movies
WHERE original_title IS NOT NULL
  AND original_title <> title;

 * sqlite:///TMDB.db
Done.

[(261,)]

### Question 17
What is the most popular movie that was made after 01/01/2000 with a budget of more than $100 000 000? (Hint: Use the popularity field in the Movies table. Larger numbers are more popular.)

In [11]:
%%sql 
SELECT title, release_date, budget, popularity, original_language
FROM movies
WHERE release_date > '2000-01-01'
  AND budget > 100000000
ORDER BY popularity DESC
LIMIT 1;

 * sqlite:///TMDB.db
Done.

[('Interstellar', '2014-11-05 00:00:00.000000', 165000000, 724.247784, 'en')]

### Question 18
How many movies are there that do not have English as their original language?

In [12]:
%%sql 
SELECT COUNT(*)
FROM movies
WHERE original_language <> 'en' 
    OR original_language IS NULL;

 * sqlite:///TMDB.db
Done.

[(298,)]

### Question 19
How many movies in the database were produced by Pixar Animation Studios?

In [13]:
%%sql
PRAGMA table_info(movies);

 * sqlite:///TMDB.db
Done.

[(0, 'movie_id', 'INTEGER', 1, None, 1),
 (1, 'title', 'varchar(500)', 0, 'NULL', 0),
 (2, 'release_date', 'datetime(6)', 0, 'NULL', 0),
 (3, 'budget', 'INTEGER', 0, 'NULL', 0),
 (4, 'homepage', 'varchar(500)', 0, 'NULL', 0),
 (5, 'original_language', 'varchar(50)', 0, 'NULL', 0),
 (6, 'original_title', 'varchar(500)', 0, 'NULL', 0),
 (7, 'overview', 'varchar(5000)', 0, 'NULL', 0),
 (8, 'popularity', 'double', 0, 'NULL', 0),
 (9, 'revenue', 'double', 0, 'NULL', 0),
 (10, 'runtime', 'double', 0, 'NULL', 0),
 (11, 'release_status', 'varchar(50)', 0, 'NULL', 0),
 (12, 'tagline', 'varchar(500)', 0, 'NULL', 0),
 (13, 'vote_average', 'double', 0, 'NULL', 0),
 (14, 'vote_count', 'INTEGER', 0, 'NULL', 0)]

In [14]:
%%sql 
SELECT COUNT(DISTINCT pcm.movie_id) AS num_movies
FROM ProductionCompanyMap pcm
JOIN ProductionCompanies pc ON pcm.production_company_id = pc.production_company_id
WHERE pc.production_company_name = 'Pixar Animation Studios';

 * sqlite:///TMDB.db
Done.

[(16,)]

### Question 20
How many movies are in the database that are both a Romance and a Comedy?

In [15]:
%%sql 
SELECT COUNT(DISTINCT gm1.movie_id) AS num_movies
FROM genremap gm1
JOIN genremap gm2 ON gm1.movie_id = gm2.movie_id
JOIN genres g1 ON gm1.genre_id = g1.genre_id
JOIN genres g2 ON gm2.genre_id = g2.genre_id
WHERE g1.genre_name = 'Romance'
  AND g2.genre_name = 'Comedy';

 * sqlite:///TMDB.db
Done.

[(484,)]

### Question 21
What is the most popular action movie that has some German in it? (Hint: The German word for German is Deutsch)

In [16]:
%%sql 
SELECT m.title, m.popularity
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
JOIN languageMap lm ON m.movie_id = lm.movie_id
JOIN languages l ON lm.iso_639_1 = l.iso_639_1
WHERE g.genre_name = 'Action'
  AND l.language_name = 'Deutsch'
ORDER BY m.popularity DESC
LIMIT 1;

 * sqlite:///TMDB.db
Done.

[('Captain America: Civil War', 198.372395)]

### Question 22
In how many movies did Tom Cruise portray the character Ethan Hunt?

In [17]:
%%sql
SELECT actor_id
FROM actors
WHERE actor_name = 'Tom Cruise';

 * sqlite:///TMDB.db
Done.

[(500,)]

In [18]:
%%sql 
SELECT COUNT(*)
FROM casts
WHERE actor_id = 500
  AND characters = 'Ethan Hunt';

 * sqlite:///TMDB.db
Done.

[(5,)]

### Question 23 
How many times was the actress Cate Blanchett nominated for an Oscar?

In [19]:
%%sql
SELECT actor_id
FROM actors
WHERE actor_name = 'Cate Blanchett';

 * sqlite:///TMDB.db
Done.

[(112,)]

In [20]:
%%sql 
SELECT COUNT(*)
FROM oscars
WHERE name = 'Cate Blanchett';

 * sqlite:///TMDB.db
Done.

[(7,)]

### Question 24
How many movies contain at least one of the official South African Languages, Afrikaans or Zulu?

In [21]:
%%sql
SELECT iso_639_1, language_name
FROM languages
WHERE language_name IN ('Afrikaans', 'Zulu');

 * sqlite:///TMDB.db
Done.

[('af', 'Afrikaans')]

In [22]:
%%sql 
SELECT COUNT(DISTINCT movie_id) AS count_of_movies
FROM languagemap
WHERE iso_639_1 IN ('af', 'zu');

 * sqlite:///TMDB.db
Done.

[(8,)]

### Question 25
Which of the movies mentioned above is the most popular?

In [23]:
%%sql 
SELECT m.title, m.popularity
FROM movies m
JOIN languagemap lm ON m.movie_id = lm.movie_id
WHERE lm.iso_639_1 IN ('af', 'zu')
ORDER BY m.popularity DESC
LIMIT 10;

 * sqlite:///TMDB.db
Done.

[('District 9', 63.13678),
 ('District 9', 63.13678),
 ('Blood Diamond', 52.792678),
 ('Safe House', 34.773106),
 ('Mandela: Long Walk to Freedom', 15.50957),
 ('Catch a Fire', 4.052219),
 ('Catch a Fire', 4.052219),
 ('Tsotsi', 2.504169),
 ('Tsotsi', 2.504169),
 ("Gangster's Paradise: Jerusalema", 1.717376)]

### Question 26
What would be the code to change the name of the language with the ‘zh’ iso code in the “language” table to ‘Chinese’?

In [24]:
%%sql 
UPDATE languages 
SET language_name = 'Chinese' 
WHERE iso_639_1 = 'zh';

 * sqlite:///TMDB.db
1 rows affected.

[]

### Question 27
What would be the code to insert a new genre called ‘Sport’ with an id of 10?

In [43]:
#%%sql
#DELETE FROM genres WHERE genre_id = 10 AND genre_name='Sport';

 * sqlite:///TMDB.db
1 rows affected.

[]

In [44]:
%%sql
INSERT INTO genres (genre_id, genre_name) VALUES (10, 'Sport');

 * sqlite:///TMDB.db
1 rows affected.

[]

### Question 28 
You have just watched The Flintstones movie and did not find it very funny. What code would delete the entry that links The Flintstones to the Comedy genre?

In [31]:
%%sql 
DELETE
FROM genremap
WHERE genre_id = 35 AND movie_id = 888;

 * sqlite:///TMDB.db
0 rows affected.

[]

### Question 29
What code will give the 10 most recently released movies in the database?

In [27]:
%%sql 
SELECT * 
FROM movies 
ORDER BY release_date DESC 
LIMIT 10;

 * sqlite:///TMDB.db
Done.

[(426469, 'Growing Up Smith', '2017-02-03 00:00:00.000000', 0, 'http://www.growingupsmithmovie.com', 'en', 'Growing Up Smith', '"In 1979, an Indian family moves to America with hopes of living the American Dream. While their 10-year-old boy Smith falls head-over-heels for the girl next door, his desire to become a ""good old boy"" propels him further away from his family\'s ideals than ever before."', 0.71087, 0.0, 102.0, 'Released', 'ItÆs better to stand out than to fit in.', 7.4, 7),
 (325373, 'Two Lovers and a Bear', '2016-10-02 00:00:00.000000', 0, None, 'en', 'Two Lovers and a Bear', 'Set in a small town near the North Pole where roads lead to nowhere, the story follows Roman and Lucy, two burning souls who come together to make a leap for life and inner peace.', 3.139294, 0.0, 96.0, 'Released', None, 6.8, 27),
 (374461, 'Mr. Church', '2016-09-16 00:00:00.000000', 8000000, None, 'en', 'Mr. Church', 'A unique friendship develops when a little girl and her dying mother inherit a cook - Mr. Church. What begins as an arrangement that should only last six months, instead spans fifteen years.', 7.828459, 0.0, 104.0, 'Released', 'He was the one person she could always count on.', 7.0, 129),
 (339408, 'The Birth of a Nation', '2016-09-09 00:00:00.000000', 8500000, 'http://www.foxsearchlight.com/thebirthofanation/', 'en', 'The Birth of a Nation', 'Nat Turner, a former slave in America, leads a liberation movement in 1831 to free African-Americans in Virgina that results in a violent retaliation from whites.', 9.452808, 15861566.0, 120.0, 'Released', 'The Untold Story of Nat Turner', 6.5, 178),
 (385736, 'Kicks', '2016-09-09 00:00:00.000000', 0, 'http://www.focusfeatures.com/kicks', 'en', 'Kicks', 'When his hard-earned kicks get snatched by a local hood, fifteen-year old Brandon and his two best friends go on an ill-advised mission across the Bay Area to retrieve the stolen sneakers.', 3.467923, 0.0, 80.0, 'Released', "They aren't just shoes", 7.5, 18),
 (332285, 'Antibirth', '2016-09-02 00:00:00.000000', 35000000, None, 'en', 'Antibirth', 'In a desolate community full of drug-addled Marines and rumors of kidnapping, a wild-eyed stoner named Lou wakes up after a crazy night of partying with symptoms of a strange illness and recurring visions. As she struggles to get a grip on reality, the stories of conspiracy spread.', 3.674294, 0.0, 94.0, 'Released', None, 4.8, 40),
 (184341, 'Hands of Stone', '2016-08-26 00:00:00.000000', 20000000, None, 'en', 'Hands of Stone', "The legendary Roberto Duran and his equally legendary trainer Ray Arcel change each other's lives.", 7.444189, 0.0, 105.0, 'Released', 'No mßs. No surrender.', 6.1, 109),
 (271969, 'Ben-Hur', '2016-08-17 00:00:00.000000', 100000000, 'http://www.benhurmovie.com/', 'en', 'Ben-Hur', 'A falsely accused nobleman survives years of slavery to take vengeance on his best friend who betrayed him.', 29.608322, 94061311.0, 125.0, 'Released', 'First to finish. Last to die.', 5.3, 621),
 (294272, "Pete's Dragon", '2016-08-10 00:00:00.000000', 65000000, 'http://movies.disney.com/petes-dragon-2016', 'en', "Pete's Dragon", 'Pete is a mysterious 10-year-old with no family and no home who claims to live in the woods with a giant, green dragon named Elliott. With the help o ... (42 characters truncated) ... r Jack owns the local lumber mill, forest ranger Grace sets out to determine where Pete came from, where he belongs, and the truth about this dragon.', 31.974359, 143695338.0, 102.0, 'Released', 'Some secrets are too big to keep.', 6.2, 679),
 (297761, 'Suicide Squad', '2016-08-02 00:00:00.000000', 175000000, 'http://www.suicidesquad.com/', 'en', 'Suicide Squad', 'From DC Comics comes the Suicide Squad, an antihero team of incarcerated supervillains who act as deniable assets for the United States government, undertaking high-risk black ops missions in exchange for commuted prison sentences.', 90.23792, 745000000.0, 123.0, 'Released', 'Worst Heroes Ever', 5.9, 7458)]

### Question 30
What code would you use to add a column to the language table that could be used for the English names of the different languages?

In [32]:
%%sql 
ALTER TABLE languages ADD language_english_name VARCHAR(50);

 * sqlite:///TMDB.db
Done.

[]